team2/app/controllers/stations_controller.rb

  def index
		@map = GMap.new("map_div_id")
		@map.control_init(:large_map => true, :map_type => true)
		@map.center_zoom_init( [50.45,30.523333], 13 )

   	@stations = {}
    Station::COLORS.each do |color|
---
SELECT * FROM "stations" WHERE (stations.color = 'green') ORDER BY external_id ASC