team2/app/controllers/train_simulator_controller.rb

  def index
    @trains = Train.all
---
SELECT * FROM "trains"